let handler = m => m
handler.all = async function (m) {
let chat = global.db.data.chats[m.chat] 
     if (/^نشر$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, '*❋• ┈─━ ◞🌩◜ ━─┈ •❋*\n*نرحب بكم في استقبال*\n*◜元 ⊰🌩⊱‏Мαиji◞*\n*❋• ┈─━ ◞🌩◜ ━─┈ •❋*\n\n*◞⟐╎اعضاء متفاعلين🔥◜*\n*◞⟐╎بنك ومتجر فخمين🏦◜*\n*◞⟐╎مسابقات وفعاليات🏀◜*\n*◞⟐╎قوانين عادلة📜◜*\n*◞⟐╎سوالف ونقاشات🎭◜*\n*◞⟐╎بوت سوالف وبوت مطور🤖◜*\n*◞⟐╎مشرفين ذو خبرة🎖◜*\n*◞⟐╎اذا صنم لا تجي🗿◜*\n*❋• ┈─━ ◞🌩◜ ━─┈ •❋*\n*●᚛|الاستقبال↯*\n```https://chat.whatsapp.com/BYcNmfA9dbzDddTFrsAdoc```\n*●᚛|من طرف↯*\n〘•⊰⊱•〙\n*❋• ┈─━ ◞🌩◜ ━─┈ •❋', m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
    if (/^اوامر$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*~⌝˼‏ادارة⊰🌩⊱Мαиji˹⌞~*\n*⎔ ⋅ ───━ •﹝🌩﹞• ━─── ⋅ ⎔*\n*●↯┊🎮الــاوامـــــر🎮┊↯●*\n*❆━━━ ─ • ❪🌩❫ • ─ ━━━❆*\n*⧉⇇ترحيب⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇نشر⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇منوع⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية القلوب⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية صناديق الحظ⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇طرد مؤبد⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية الروليت⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية كرة القدم⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية الهاشيرا⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية ديث نوت⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية الزومبي⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية الباتل رويال⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية الايموجي⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية شد الحبل⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇سؤال مفاجئ⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇اعلان ترقية⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية الاصوات⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية الروليت⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية كرة القدم⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية الهوكاجي⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية مصاص الدماء⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇انذار⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇تحويل⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇طرد تأديبي⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇ملوك الاسبوع⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇تنازل⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇اعفاء⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇مقولات⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇فعالية الابراج⇉*\n*‏❅ ━ ── • 🌩 • ── ━ ❅*\n*⧉⇇شراء سلعة⇉*\n*❆━━━ ─ • ❪🌩❫ • ─ ━━━❆*\n*❖╏تـوقــيــ✍︎ـع: -*\n*◜Мαиji 🌩╎元◞*\n*⎔ ⋅ ───━ •﹝🌩﹞• ━─── ⋅ ⎔*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية القلوب$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*🍁╎تعلن الادارة عن  مسابقة القلوب╎~🍁*\n\n*❖━══━═❈•|🍁|•❈═━══━❖*\n*💠╎ التفاصيل 📋 :*\n\n*💠آلــمــقـدم🎙〖️〗*\n\n*💠 عہدد ألأسئلة 🧾╎〖〗*\n\n*💠 الوقت⏱️╎〖〗*\n\n*💠 نوع الفعاليه 〖القلوب ❤️〗*\n*❖━══━═❈•|🍁|•❈═━══━❖*\n\n *🍁╿ شرح فعاليه ╿🍁*\n\n *❶ تـتـكـون مــن عدد معين المشاركين نعطي كل واحد عدد معين من القلوب*\n\n*❷ ويـجـب عـلى المشاركين الإجابة على الصور او الاسىلة التي يتم طرحها واول واحد يجاوب ياخد نقطة*\n\n *❸ أخر واحد تبقى له قلوب هو الفائز , إذا وجـدت بـجـانـب لـقـبـك [☠] فـهـذا يـعـنـي أنـك خـسرت.*\n\n*◎═━══━═•◆🍁◆•══━═━═◎*\n*💠اول عضو تظهر اجابته عند《 مقدم الفعالية 》وتكون صحيحة، هو من يحصل على نقطة*\n\n\n*💠ارسال أي صورة او فيديو خلال مسابقـة يكلفك 《تنبيه》*\n\n\n*❖━══━═❈•🍁•❈═━══━❖*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
 if (/^فعالية القلوب$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*✤ مشاركين ❤️ الفعالية ✤*\n\n◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆\n\n*『اللقب ❤️ القلوب』* \n\n*←『』»『』* \n*←『』»『』* \n*←『』»『』*\n*←『』»『』* \n*←『』»『』* \n\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
if (/^فعالية القلوب$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*❤️╿ إعلان عن نتائج فعاليه القلوب ╿❤️*~\n*╭───── • ◈ • ─────╮*\n*❃ الــمــقــدم⇍【】*\n*❃ الـجــائــزة⇍【❂100】*\n\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n*⇃🥇⇂ الــمــركــز الــأول ⤋*\n*【】➥*\n*الــجــائــزة⇍『❂120』*\n\n*⇃🥈⇂ الــمــركــز الـثـاني*\n*【】➥* \n*الــجــائــزة⇍『❂100』*\n*⇃🥉⇂ الــمــركــز الثـالـث ⤋*\n*【】➥*\n*الــجــائــزة⇍『❂70』*\n\n\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n*⇃🏅⇂ بــاقــي الــمــشــاركــيــن ⤋*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*الــجــائــزة⇍『❂50』*\n\n*╰─────• ◈ •  ─────╯*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية صناديق الحظ$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, ` *╭━━ ═━━╃✧⊰🍁⊱✧╄━━═ ━━╮*\n\n  *┃🎁•﹝ فعالية صناديق الحظ ﹞•🎁┃*\n\n*شرح الفعالية:*  \n*1-الاسىلة عبارة عن صور او كتابة حسب المتوفر 🏹*\n*2-كل نقطة تحرزها تختار احد الصناديق لفتحه🎁*\n*3-يوجد نوعان من الصناديق بعضهم مفيد وبعضهم ضار انت وحضك☠️*\n\n1-🎁\n2-🎁\n3-🎁\n4-🎁\n5-🎁\n6-🎁\n7-🎁\n8-🎁\n9-🎁\n10-🎁\n\n*المقدم 🏆:『』*\n*╭━━ ═━━╃✧⊰ 🍁 ⊱✧╄━━═ ━━╮*\n*⧉⇄┋مـع تـحـيـات ادارة:*\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^طرد مؤبد$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, ` *┐══━━✥◈✥━═━═┌*\n\n*🚨┊اعــلان عن طرد مؤبد┊🚨*\n\n*❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n\n*♧💫┋اللقـب 「」*\n\n*♧ 📧┋الـمنشـن  :『』*\n\n*♧❓┋ الـسبـب »「」*\n\n*♧ 👨🏻💻┋ المسؤول「」*\n\n*⚜︎══⊹⊱ «◈» ⊰⊹══⚜︎*\n\n*‏⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الهاشيرا$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*🌸~╎تعلن الادارة عن مسابقة ╎~*😈 \n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n*💠╎ التفاصيل 📋 :*\n\n*💠آلــمــقـدم🎙️╎〖〗*\n\n*💠 عہدد ألأسئلة 🧾╎〖〗*\n\n*💠 الوقت⏱️╎〖〗*\n\n*💠 نوع الفعاليه 〖الهاشيرا 🌸 ضد الشياطين 😈〗*\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n\n 🍁 *╿ شرح فعاليه ╿*🍁\n\n *💠 تـتـكـون مــن 5 مـشـاركـيـن هاشيرا 🌸 و 5 شياطين علوية 😈 والمنافسة عبارة عن فريقين فريق الهاشيرا و فريق الشياطين*\n\n*💠 ويـجـب عـلـى الهاشيرا قطع رؤوس الشياطين عـكـس الـشياطين  الـذيـن يـجـب عـلـيـهـم تـدمـيـر الـقـلـوب  الـخـمـسـه الـتـي يـمـتـلـكـهـا الزومبي كل هاشيرا، كـل نـقـطـة يـربـحـها احد المشاركين من فريق الهاشيرا يختار شيطان من الفريق الثاني لقتله بـالتنفس الخاص به* \n\n *💠 أمـا الشيطان كـل نـقـطـه يـربـحـهـا  ياكل قلب واحـد مــن هاشيرا يـخـتـاره اذا اكل الشيطان كل  الـقلوب الـتـي يـمـتـلـكـهـا الـهاشيرا  يُـطـرد الـهاشيرا  مـن الـفـعـالـيـة، إذا وجـدت بـجـانـب لـقـبـك [☠] فـهـذا يـعـنـي أنـك خـسـرت.*\n\n *💠 يفوز الفريق الذي تبقى له اكثر عدد من الأعضاء ❤️*\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n*💠اول عضو تظهر اجابته عند《 مقدم الفعالية 》وتكون صحيحة، هو من يحصل على نقطة*\n\n\n*💠ارسال أي صورة او فيديو خلى مسابقـة يكلفك 《إنذار》*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*💠ونتمني من الجميع المشاركة في الفعاليه❤️.* \n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الهاشيرا$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*●━━ ━ • ❪🍁❫  • ━ ━━●*\n\n*☆مشاركين 🩸 المسابقة☆*\n\n*●━━ ━ • ❪ الهاشيرا 🌸 ❫  • ━ ━━●*\n\n*『اللقب 🌸 هاشيرا』*\n\n*← 『 هاشيرا الصخر 🪨【 】』»『❤️❤️❤️❤️❤️ 』* \n*←『 هاشيرا الضباب ☁️【 】』» 『🤍🤍🤍🤍 』* \n*← 『هاشيرا الماء 💧【 】 』»『💙💙💙 』*\n*←『هاشيرا النار 🔥【 】 』» 『🧡🧡🧡 』* \n*←『 هاشيرا الحب 💖【 】』» 『💖💖 』*\n\n*●━━ ━ • ❪ الشياطين 😈❫  • ━ ━━●*\n\n*『اللقب 😈 الشياطين 』*\n\n*← 『 القمر العلوي الاول 🗡️【 】』»『🖤🖤🖤🖤🖤 』*\n*← 『 القمر العلوي الثاني 🩸【 】』»『❤️❤️❤️❤️』*\n*← 『 القمر العلوي الثالت 🏀【 】』»『💛💛💛💛 』*\n*← 『 القمر العلوي الخامس 💢【 】』»『💜💜💜 』*\n *← 『 القمر العلوي السادس ⛏️【 】』»『💚💚 』*\n\n*●━━ ━ • ❪🍁❫  • ━ ━━●*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الهاشيرا$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `~*🌸╿اعلان عن نتائج المسابقة╿😈*~\n\n*❍↵┆جـوائــز المــســابقــة 🌸↶*\n\n*◆━━━━━◆😈◆━━━━━◆*\n\n*❏⇍┋المــقــدم 🎙️⇩*\n\n*☯︎⇄『』*\n*💰┆⇄الجـائـزة : 「❂200」*\n\n*◆━━━━━◆🌸◆━━━━━◆*\n\n*❍↵┋اعـضـاء الفــريـق الفــائــز 🏆*\n\n*➥【  】*\n\n*💰┆⇄الجـائـزة : 「❂150」*\n\n*◆━━━━━◆😈◆━━━━━◆*\n*❍↵┋اعـضـاء الفـريـق الخـاسـر 🏅*\n\n*〘  〙*\n\n*💰┆⇄الجـائـزة : 「❂100」*\n\n*◆━━━━━◆🌸◆━━━━━◆*\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الزومبي$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*🍁~╎تعلن الادارة عن مسابقة ╎~*🍁\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n*💠╎ التفاصيل 📋 :*\n\n*💠آلــمــقـدم🎙️╎〖〗*\n\n*💠 عہدد ألأسئلة 🧾╎〖〗*\n\n*💠 الوقت⏱️╎〖〗*\n\n*💠 نوع الفعاليه 〖الزو🧟‍♂️مبي〗*\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n\n *🧟♀️╿ شرح فعاليه ╿*🧟‍♂️\n\n *💠 تـتـكـون مــن 5 مـشـاركـيـن بـشـر و مـصـاص زومبي واحـد، الزومبي لـديـه 5 قـلـوب سـوداء 🖤و الـبـشـر لـديـهـم قـلبين ❤️❤️*\n*💠 ويـجـب عـلـى الزومبي اكل قلوبهم عـكـس الـبـشـر الـذيـن يـجـب عـلـيـهـم تـدمـيـر الـقـلـوب  الـخـمـسـه الـتـي يـمـتـلـكـهـا الزومبي 🧟‍♂️، كـل نـقـطـتـيـن يـربـحـها الـبـشـر يُـطـعـن الزومبي بـالرصاصة الـفـضـية [ 🗡️ ] ويُـنـتـزع  مـنـه قـلـب*\n *💠 أمـا الزومبي كـل نـقـطـهـا يـربـحـهـا  ياكل قلب واحـد مــن بـشـري يـخـتـاره اذا اكل الزومبي قلبين مـن الـقلوب الـتـي يـمـتـلـكـهـا الـبـشـري يُـطـرد الـبـشـري مـن الـفـعـالـيـة، إذا وجـدت بـجـانـب لـقـبـك [☠] فـهـذا يـعـنـي أنـك خـسـرت.*\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n*💠اول عضو تظهر اجابته عند《 مقدم الفعالية 》وتكون صحيحة، هو من يحصل على نقطة*\n\n*💠ارسال أي صورة او فيديو خلى مسابقـة يكلفك 《إنذار》*\n\n*💠ونتمني من الجميع المشاركة في الفعاليه❤️.* \n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الزومبي$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*●━━ ━ • ❪ 🍁 ❫  • ━ ━━●*\n\n*❏┆مشاركين 🧟‍♀️ المسابقة*\n\n*●━━ ━ • ❪ البشر🧑🏻 ❫  • ━ ━━●*\n\n*『اللقب 🧑🏻 البشر』*\n\n*← 『 』»『❤️❤️ 』* \n*←『 』» 『❤️❤️ 』* \n*← 『 』»『❤️❤️ 』*\n*←『 』» 『❤️❤️ 』* \n*←『 』» 『❤️❤️ 』*\n\n*●━━ ━ • ❪ الزو🧟‍♂️مبي ❫  • ━ ━━●*\n\n*『اللقب 🖤 القلوب 』*\n\n*← 『 』»『🖤🖤🖤🖤🖤 』* \n\n*●━━ ━ • ❪🍁❫  • ━ ━━●*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الزومبي$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `~*🙋🏻♂️╿اعلان عن نتائج المسابقة╿🧟‍♂️*~\n\n*❍↵┆جـوائــز المــســابقــة 🧟‍♂️↶*\n\n*◆━━━━━◆🧟‍♂️◆━━━━━◆*\n\n*❏⇍┋المــقــدم 🎙️⇩*\n\n*☯︎⇄『』*\n*💰┆⇄الجـائـزة : 「❂220」*\n\n*◆━━━━━◆🙋🏻♂️◆━━━━━◆*\n\n*❍↵┋اعـضـاء الفــريـق الفــائــز 🏆*\n\n*➥【  】*\n\n*💰┆⇄الجـائـزة : 「❂260」*\n\n*◆━━━━━◆🧟◆━━━━━◆*\n*❍↵┋اعـضـاء الفـريـق الخـاسـر 🏅*\n\n*〘  〙*\n\n*💰┆⇄الجـائـزة : 「❂160」*\n\n*◆━━━━━◆🙋🏻♀️◆━━━━━◆*\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الباتل رويال$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*🍁~╎تعلن الادارة عن مسابقة الباتل رويال╎~*🍁\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n*💠╎ التفاصيل 📋 :*\n\n*💠آلــمــقـدم🎙️╎〖〗*\n\n*💠 عہدد ألمشاركين 🧾╎〖+5〗*\n\n*💠 الوقت⏱️╎〖〗*\n\n*💠 نوع الفعاليه 〖باتل رويال🤺〗*\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n\n 🍁 *╿ شرح فعاليه ╿*🍁\n\n *💠 يقوم المقدم بعمل قروب خاص بالفعالية ويتم الانتضار حتى يكتمل العدد*\n\n*💠 يعطي المقدم الاشراف عند اكتمال العدد لكل المشاركين ولا تقم بفعل شيء الى ان يقوم المقدم باعطائك الأمر*\n\n *💠 يبدا المقدم بالعد الى 3 اذا شفت رقم ثلاتة تبدا بطرد المشاركين*\n\n *💠 يفوز اخر واحد يبقى بالقروب مع المقدم🥷*\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n*💠اذا قمت بطرد احد قبل ما يبدا المقدم بالعد او قبل ما ينتهي يتم اقصائك من المسابقة*\n\n*💠ارسال الصور او الفيديوهات او رسالة عندما يبدأ المقدم بالعد يكلفك《إنذار》*\n\n*💠ونتمني من الجميع المشاركة في فعاليه❤️.* \n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الباتل رويال$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `~*🏹╿ إعلان عن نتائج مسابقة الباتل رويال╿🏹*~\n*╭───── • ◈ • ─────╮*\n*❃ الــمــقــدم⇍【】*\n*❃ الـجــائــزة⇍【❂200】*\n\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n*⇃🥇⇂ الــمــركــز الــأول ⤋*\n*【】➥*\n*الــجــائــزة⇍『❂150』*\n\n*⇃🥈⇂ الــمــركــز الـثـاني*\n*【】➥* \n*الــجــائــزة⇍『❂100』*\n*⇃🥉⇂ الــمــركــز الثـالـث ⤋*\n*【】➥*\n*الــجــائــزة⇍『❂80』*\n\n\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n*⇃🏅⇂ بــاقــي الــمــشــاركــيــن ⤋*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*الــجــائــزة⇍『❂50』*\n\n*╰─────• ◈ •  ─────╯*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الاصوات$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*~🔊╎فـعـالـيـة الاصـوات ╎🔊~*\n*⎔ ⋅ ──━ •﹝🍁﹞• ━── ⋅ ⎔*\n*❐⤶🏹┆المسـتـوى  : ⟦ ⟧*\n\n*❐⤶💵┆المكـافئـة  : ⟦❂25⟧*\n\n*❐⤶👨🏻💻┆المـسـؤول  : ⟦ ⟧*\n*⎔ ⋅ ──━ •﹝🍁﹞• ━── ⋅ ⎔*\n*⧉┋مـع تـحـيـات :*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الاصوات$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*~📯╎النـتــائـج╎📯~*\n*⎔ ⋅ ──━ •﹝🍁﹞• ━── ⋅ ⎔*\n*❍↵⁉️┆الجـواب  : ❬ ❭*\n\n*❍↵🏆┆الفـائـز   : ❬ ❭*\n\n*❍↵💵┆المكـافئـة  : ❬❂25❭*\n\n*❍↵👨🏻💻┆المـسـؤول  : ❬ ❭*\n*⎔ ⋅ ──━ •﹝🍁﹞• ━── ⋅ ⎔*\n*⧉┋مـع تـحـيـات :*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الايموجي$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*~🤓╎فـعـالـيـة الايـمـوجـي ╎🫣~*\n*⎔ ⋅ ──━ •﹝🍁﹞• ━── ⋅ ⎔*\n*❐⤶🏹┆المسـتـوى  : ⟦ ⟧*\n\n*❐⤶👁️┆الايـمـوجـي  : ⟦⟧*\n\n*❐⤶💵┆المكـافئـة  : ⟦❂10⟧*\n\n*❐⤶👨🏻💻┆المـسـؤول  : ⟦ ⟧*\n*⎔ ⋅ ──━ •﹝🍁﹞• ━── ⋅ ⎔*\n*⧉┋مـع تـحـيـات :*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الايموجي$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*~📯╎النـتــائـج╎📯~*\n*⎔ ⋅ ──━ •﹝🍁﹞• ━── ⋅ ⎔*\n*❍↵⁉️┆الجـواب  : ❬ ❭*\n\n*❍↵🏆┆الفـائـز   : ❬ ❭*\n\n*❍↵💵┆المكـافئـة  : ❬❂10❭*\n\n*❍↵👨🏻💻┆المـسـؤول  : ❬ ❭*\n*⎔ ⋅ ──━ •﹝🍁﹞• ━── ⋅ ⎔*\n*⧉┋مـع تـحـيـات :*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^اعلان ترقيه$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*『✦اعـلان تـرقـيـة✦』*\n*●━━ ━ ━ •⊰ 🍁 ⊱• ━ ━ ━━●*\n\n*❍↵الـلــقــب⁉️┋: 『┆』*\n\n*❍↵الـرتـبـة السـابـقـة💫┋ : 『』*\n\n*❍↵الـرتـبـة الحـالـية🛡️┋  :‏『』*\n\n*❏↵المسـؤول👨🏻💻 : ¦☬  ☬¦*\n*●━━ ━ ━ •⊰ 🍁 ⊱• ━ ━ ━━●*\n*★الــــرســالــه ☕︎︎ :  〘مبارك ترقيتك نرجو ان تساهم في تطوير المملكة و نتمنى لك النجاح والتوفيق الدائم 🌹〙*\n\n*❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n *⧉⇄┆🍁「تـوقــيع ✍🏻」*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية شد الحبل$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*🪢~╎تعلن الادارة عن شد الحبل╎~🪢*\n\n*❖━══━═❈•|🍁|•❈═━══━❖*\n*💠╎ التفاصيل 📋 :*\n\n*💠آلــمــقـدم🎙〖️〗*\n\n*💠 عہدد ألأسئلة 🧾╎〖〗*\n\n*💠 الوقت⏱️╎〖〗*\n\n*💠 نوع الفعاليه 〖شد الحبل 🪢〗*\n*❖━══━═❈•|🍁|•❈═━══━❖*\n\n *🍁╿ شرح الفعاليه ╿*🍁\n\n *❶ المسابقة تتكون من فريقين متساويين كل فريق يمتلك 5 نقاط*\n\n*❷ بعد ان يتم عرض الاسئلة الفريق اللي يجاوب اولا يحصل على نقطة (6) نقاط والفريق الاخر تنقص منه نقطة (4) نقاط*\n *❸ اذا جبت 10 نقاط تفوز لان الفريق الآخر يصير عنده 0*\n\n*◎═━══━═•◆🍁◆•══━═━═◎*\n*💠اول عضو تظهر اجابته عند《 مقدم الفعالية 》وتكون صحيحة، هو من يحصل على نقطة*\n\n*💠ارسال أي صورة او فيديو خلال مسابقـة يكلفك 《تنبيه》*\n\n*❖━══━═❈•🍁•❈═━══━❖*\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية شد الحبل$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*◆━━━━━◆🪢◆━━━━━◆*\n*🫂Team A :【  】*\n\n*🎯points :『5』*\n◆━━━━━◆🪢◆━━━━━◆\n*🫂Team B : 【  】*\n\n*🎯points :『5』*\n◆━━━━━◆🪢◆━━━━━◆*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية شد الحبل$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `🪢╿اعلان عن نتائج المسابقة╿🪢*~\n\n*❍↵┆جـوائــز المــســابقــة 🍁↶*\n\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n\n*❏⇍┋المــقــدم 🎙️⇩*\n\n*☯︎⇄『』*\n*💰┆⇄الجـائـزة : 「❂300」*\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n\n*❍↵┋اعـضـاء الفــريـق الفــائــز 🏆*\n\n*➥【  】*\n*💰┆⇄الجـائـزة : 「❂250」*\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n*❍↵┋اعـضـاء الفـريـق الخـاسـر 🏅*\n\n*〘  〙*\n*💰┆⇄الجـائـزة : 「❂150」*\n\n*❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n*❍↵┆🍁「تـوقــيع  ✍🏻」*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^فعالية الروليت$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*🍁~╎تعلن الادارة عن  مسابقة الروليت╎~🍁*\n\n*❖━══━═❈•|🍁|•❈═━══━❖*\n*💠╎ التفاصيل 📋 :*\n\n*💠آلــمــقـدم🎙〖️〗*\n\n*💠 عہدد ألأسئلة 🧾╎〖〗*\n\n*💠 الوقت⏱️╎〖〗*\n\n*💠 نوع الفعاليـه 〖الرولـيــ🎰ــت 〗*\n*❖━══━═❈•|🍁|•❈═━══━❖*\n\n *🎰╿ شـرح الفـعـاليـه ╿🎰*\n\n*❶ تـتـكـون مـن عـدد معيـن مـن المشـاركيـن نعـطـي كـل واحـد عـدد مـعيـن مـن النـقـاط (100) نقـطـة*\n\n*❷ ويـجـب على المشـاركيـن الإجـابـة على الصـور او الاسئـلـة التـي يتـم طـرحـها واول واحـد يجـاوب يـاخـد محـاولـة*\n\n*❸ يقـوم المشـرف بـإدارة الـروليـت ويحصـل عـلى خصـم او كسـب حسـب حظـه , إذا نـفـذت نقـاطـك و وجـدت بـجـانـب لـقـبـك [☠] فـهـذا يـعـنـي أنـك خـسرت.*\n\n*◎═━══━═•◆🍁◆•══━═━═◎*\n*💠اول عضو تظهر اجابته عند《 مقدم الفعالية 》وتكون صحيحة، هو من يحصل على نقطة*\n\n*💠ارسال أي صورة او فيديو خلال مسابقـة يكلفك 《تنبيه》*\n\n*❖━══━═❈•🍁•❈═━══━❖*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V
}
  if (/^فعالية الروليت$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*●━━ ━ • ❪ 🍁 ❫  • ━ ━━●*\n\n*☯︎╎مشاركين 🍁 الفعالية 🎰*\n\n*●━━ ━ • ❪ 🍁 ❫  • ━ ━━●*\n\n*『اللقب  🎰 النقاط』* \n\n*←『』»『100』* \n*←『』»『100』* \n*←『』»『100』*\n*←『』»『100』* \n*←『』»『100』*\n*←『』»『100』*\n\n*●━━ ━ • ❪🍁❫  • ━ ━━●*`, m) //wm, null, [['Menu', '#menu']], m) botones :V
}
  if (/^فعالية الروليت$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `~*🎰╿ إعلان عن نتائج مسابقة الروليت ╿🎰*~\n*╭───── • ◈ • ─────╮*\n*❃ الــمــقــدم⇍【】*\n*❃ الـجــائــزة⇍【❂200】*\n\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n*⇃🥇⇂ الــمــركــز الــأول ⤋*\n*【】➥*\n*الــجــائــزة⇍『❂250』*\n\n*⇃🥈⇂ الــمــركــز الـثـاني*\n*【】➥* \n*الــجــائــزة⇍『❂200』*\n*⇃🥉⇂ الــمــركــز الثـالـث ⤋*\n*【】➥*\n*الــجــائــزة⇍『❂150』*\n\n\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n*⇃🏅⇂ بــاقــي الــمــشــاركــيــن ⤋*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*الــجــائــزة⇍『❂100』*\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V
}
  if (/^فعالية كرة القدم$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*~⚽╎تعلن الادارة عن  مسابقة كرة القدم╎⚽~*\n\n*❖━══━═❈•|🍁|•❈═━══━❖*\n*💠╎ التفاصيل 📋 :*\n\n*💠آلــمــقـدم🎙〖️〗*\n\n*💠 عہدد ألأسئلة 🧾╎〖〗*\n\n*💠 الوقت⏱️╎〖〗*\n\n*💠 نوع الفعاليـه 〖كـ⚽ـرة القـ🏟️ـدم 〗*\n*❖━══━═❈•|🍁|•❈═━══━❖*\n\n *⚽╿ شـرح الفـعـاليـه ╿⚽*\n\n*❶ تـتـكـون مـن فـريـقـيـن متسـاوييـن و في مدة مـعيـنة مـن الوقـت يجب عليـهـم تسجيـل أكبـر عـدد من الاهـداف ⚽*\n\n*❷ ويـجـب على المشـاركيـن الإجـابـة على الصـور او الاسئـلـة التـي يتـم طـرحـها وكـل نقطتـين بهـدف*\n\n*❸الفـريـق صـاحـب اكثـر عدد من الاهـداف يفـوز مع نهـايـة المبـاراة التي مدتـها 2 دقـائـق🏆*\n\n*◎═━══━═•◆🍁◆•══━═━═◎*\n*💠اول عضو تظهر اجابته عند《 مقدم الفعالية 》وتكون صحيحة، هو من يحصل على نقطة*\n\n*💠ارسال أي صورة او فيديو خلال مسابقـة يكلفك 《تنبيه》*\n\n*❖━══━═❈•🍁•❈═━══━❖*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V
}
  if (/^فعالية كرة القدم$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*◆━━━━━◆⚽◆━━━━━◆*\n\n*『╎🆚╎』*\n\n*◆━━━━━◆⚽◆━━━━━◆*\n\n*🫂╎الـفـريـق A :【】*\n\n*📜╎اسـم الـفـريـق : ⊆⊇*\n\n*🎯╎عـدد الأهـداف :『-』*\n◆━━━━━◆⚽◆━━━━━◆\n*🫂╎الـفـريـق B :【】*\n\n*📜╎اسـم الـفـريـق : ⊆⊇*\n\n*🎯╎عـدد الأهـداف :『-』*\n*◆━━━━━◆⚽◆━━━━━◆*`, m) //wm, null, [['Menu', '#menu']], m) botones :V
}
  if (/^فعالية كرة القدم$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `~*⚽╿اعلان عن نتائج المسابقة╿⚽*~\n\n*❍↵┆جـوائــز المــســابقــة ⚽↶*\n\n*⊱⊹╾╾╾──❯⚽❮──╼╼╼⊹⊰*\n\n*❏⇍┋المــقــدم 🎙️⇩*\n\n*☯︎⇄『』*\n*💰┆⇄الجـائـزة : 「❂150」*\n*⊱⊹╾╾╾──❯⚽❮──╼╼╼⊹⊰*\n\n*❍↵┋اعـضـاء الفــريـق الفــائــز 🏆*\n\n*➥【  】*\n*💰┆⇄الجـائـزة : 「❂250」*\n*⊱⊹╾╾╾──❯⚽❮──╼╼╼⊹⊰*\n*❍↵┋اعـضـاء الفـريـق الخـاسـر 🏅*\n\n*〘  〙*\n*💰┆⇄الجـائـزة : 「❂150」*\n\n*❆━━━━━═⏣⊰⚽⊱⏣═━━━━━❆*\n*❍↵┆🍁「تـوقــيع  ✍🏻」*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V
}
  if (/^فعالية الابراج$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*~🏰╎إعلان عن   فعاليه الابراج ╎🏰~*\n\n*✦━━━━━━━━❖━━━━━━━━✦*\n*❈╎ التفاصيل 📜 :*\n\n*✦ آلــمــقـدم 🎙️╎〖〗*\n\n*✦ عدد ألأسئلةّ 🧾╎〖〗*\n\n*✦ الوقت ⏱️╎〖〗*\n\n*✦ نہو؏ فعاليه╎〖الابراج 🏰〗*\n\n*❖━══━══⏣⊰🍁⊱⏣══━══━❖*\n\n  *🏰╿ شرح الفعاليه ╿🏰*\n\n*※-كل شخص لديه 3 ابراج 🏰 .*\n\n*※-عند الفوز بنقطة تحصل على قنبلة 💣 مدفع ترسلها لبرج  خصومك.*\n\n*※-الشخص اللذي يتلقى 3 مدافع يقصى (يخسر 💥).*\n\n*✦━━━━━━⏣⊰🍁⊱⏣━━━━━━✦*\n*❃ اول عضو تظهر اجابته عند《 المقدم 》وتكون صحيحة، يحصل على نقطة*\n\n  *❃بعد ما يتبقى برج واحد  تنتهي الفعالية ☁️*\n\n*❃ الاعتراض في وسط فعاليه يكلفك 《 انـذار 》*\n\n*❃ ارسال أي صورة او فيديو خلى مسابقـة يكلفك 《تنبيه》*\n*❖━══━═❈•|🍁|•❈═━══━❖*\n\n*❍↵┆🍁「تـوقــيع  ✍🏻」*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V
}
  if (/^فعالية الابراج$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*~〘آلُأعٌضآء آلُمْشُآرڪيُنْ〙~*\n\n*❃━═━═✦🍁✦═━═━❃*\n\n*|  |「الألقاب」&「النقاط」*\n*1|  | « »*\n*2|  | « »* \n*3|  | « »*\n*4|  | « »*\n*5|  | « »*\n*6|  | « »*\n*7|  | « »*\n\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n\n*❉- مْـقٌڊم فعاليه 🏆:【 】*\n\n*❃━═━═✦•〘•🍁•〙•✦═━═━❃*\n\n*「مع تحيات ادارة *【𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師】」*`, m) //wm, null, [['Menu', '#menu']], m) botones :V
}
  if (/^فعالية الابراج$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `~*🏰╿ إعلان عن نتائج مسابقة الابراج ╿🏰*~\n*╭───── • ◈ • ─────╮*\n*❃ الــمــقــدم⇍【】*\n*❃ الـجــائــزة⇍【❂200】*\n\n*⊱⊹╾╾╾──❯🏰❮──╼╼╼⊹⊰*\n*⇃🥇⇂ الــمــركــز الــأول ⤋*\n*【】➥*\n*الــجــائــزة⇍『❂250』*\n\n*⇃🥈⇂ الــمــركــز الـثـاني*\n*【】➥* \n*الــجــائــزة⇍『❂200』*\n*⇃🥉⇂ الــمــركــز الثـالـث ⤋*\n*【】➥*\n*الــجــائــزة⇍『❂150』*\n\n\n*⊱⊹╾╾╾──❯🏰❮──╼╼╼⊹⊰*\n*⇃🏅⇂ بــاقــي الــمــشــاركــيــن ⤋*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*الــجــائــزة⇍『❂100』*\n*⊱⊹╾╾╾──❯`, m) //wm, null, [['Menu', '#menu']], m) botones :V
}
  if (/^اعفاء$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*『✦اعـلان عـن إعـفـاء✦』*\n*⏣═━━─•༺𓆩🍁𓆪༻•─━━═⏣*\n\n*❍↵الـلــقــب⁉️┋: 『┆』*\n\n*❍↵الـرتـبـة السـابـقـة💫┋ : 『』*\n\n*❍↵الـرتـبـة الحـالـية🛡️┋  :‏『』*\n\n*❏↵المسـؤول👨🏻💻 : ¦☬  ☬¦*\n*⏣═━━─•༺𓆩🍁𓆪༻•─━━═⏣*\n*⧉⇄┆🍁「تـوقــيـع ✍🏻」*\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V
}
  if (/^مقولات$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*◆👥اعلان عن فعالية المقولات 👥◆*\n*❖━━━━━❪🍁❫━━━━━❖*\n*🍁┆المقولة ⁉️ : 【】*\n\n*🍁┆المدة 🏹 : 【】*\n\n*🍁┆المكافأه 💵 : 【❂50】*\n\n*🍁┆المسؤول🗣️  : 【】*\n*❖━━━━━❪🍁❫━━━━━❖*\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V
}
  if (/^مقولات$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*◆📯إنتهت📯◆*\n*❖━━━━━╰🍁╯━━━━━❖*\n*❖ الرابح 🏆 : 『』*\n\n*❖ الإجابة 🏹 : 『』*\n\n*❖المكافأه 💵 : 『❂50』*\n*❖━━━━━╰🍁╯━━━━━ ❖*\n*⧉⇄┋مـع تـحـيـات ادارة:*\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V
}
  if (/^ملوك الاسبوع$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*『✦👑 اعـلان عـن مـلـوك الاسـبـوع 👑✦』*\n*✦━──━━∞🍁∞━━──━✦*\n\n*❍↵┋العـضـو المـمـيـز ✨ : 『┆@』*\n\n*❍↵┋مـلـك التـفـاعـل 🔥 : 『┆@』*\n\n*❍↵┋مـلـك المسـابـقـات 🤹🏻‍♂️ :‏『┆@』*\n\n*❍↵┋افـضـل مـقـدم🎙️ :‏『┆@』*\n\n*❏↵المسـؤول👨🏻💻 : ¦☬  ☬¦*\n*●━━ ━ ━ •⊰ 🍁 ⊱• ━ ━ ━━●*\n‏『 *🍁𝑯𝑼𝑵𝑻𝑬𝑹𝑺🍁*』`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^طرد تأديبي$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*┐══━━✥◈✥━═━═┌*\n\n*🚨┊اعــلان عن طرد تاديبي┊🚨*\n\n*❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n\n*☜💫┋اللقـب 「」*\n\n*☜📧┋الـمنشـن  :『』*\n\n*☜❓┋ الـسبـب »「」*\n\n*☜⌛┋الـمدة  :『』*\n\n*☜ 👨🏻💻┋ المسؤول「」*\n\n*⚜︎══⊹⊱ «◈» ⊰⊹══⚜︎*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
  if (/^شراء سلعه$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*┐══━━✥◈✥━═━═┌*\n\n*🏪┊اعــلان عن شراء سلعة┊🏪*\n\n*❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n\n*☜💫┋اللقـب 「」*\n\n*☜📧┋الـمنشـن  :『』*\n\n*☜🛍️┋ الـسـلعـة »「」*\n\n*☜💴┋الـثـمـن  :『』*\n\n*☜ 👨🏻💻┋ المسـؤول「」*\n\n*⚜︎══⊹⊱ «◈» ⊰⊹══⚜︎*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^تنازل$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*『✦اعـلان عـن تـنـازل ✦』*\n*●━━ ━ ━ •⊰ 🍁 ⊱• ━ ━ ━━●*\n\n*❍↵الـلــقــب⁉️┋: 『┆』*\n\n*❍↵الـرتـبـة السـابـقـة💫┋ : 『』*\n\n*❍↵الـرتـبـة الحـالـية🛡️┋  :‏『』*\n\n*❍↵الـسـبـب ⬅️ ┋  :‏『』*\n*●━━ ━ ━ •⊰ 🍁 ⊱• ━ ━ ━━●*\n*★الــــرســالــه ☕︎︎ :  〘يؤسفنا الاعلان عن تنازلك و نتمنى لك النجاح والتوفيق الدائم 🌹〙*\n*❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n *⧉⇄┆🍁「تـوقــيع ✍🏻」*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^انذار$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*┐══━━✥◈✥━═━═┌*\n\n*🚨┊اعــلان عن انذار┊🚨*\n\n*❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n\n*✎💫┋اللقـب 「」*\n\n*✎ 📧┋الـمنشـن  :『』*\n\n*✎⁉️┋ الـسبـب »「」*\n\n*✎💴┋خـصـم »「❂」*\n\n*✎ 🔢 ┋عدد الانذارات「」*\n\n*⚜︎══⊹⊱ «◈» ⊰⊹══⚜︎*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^فعالية مصاص الدماء$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*●━━ ━ • ❪ 🍁 ❫  • ━ ━━●*\n\n*☕︎︎┋الـمـشـاركـيـن┋☕︎︎*\n\n*●━━ ━ • ❪ البشـ🙋🏻♂️ـر ❫  • ━ ━━●*\n\n*『اللقب 🧑🏻 البشر』*\n\n*←『 』»『🩸🩸』* \n*←『 』»『🩸🩸』* \n*←『 』»『🩸🩸』*\n*←『 』»『🩸🩸』* \n*←『 』»『🩸🩸』*\n\n*●━━ ━ • ❪ مصـ🧛🏻♂️ـاص الدمـ🩸ـاء❫  • ━ ━━●*\n\n*『اللقـب 🖤 القلـوب 』*\n\n*← 『 』»『🖤🖤🖤🖤🖤 』* \n\n*●━━ ━ • ❪🍁❫  • ━ ━━●*<#>*🩸~╎تعلن الادارة عن مسابقة ╎~*🩸\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n*💠╎ التفاصيل 📋 :*\n\n*💠آلــمــقـدم🎙️╎〖〗*\n\n*💠 عہدد ألأسئلة 🧾╎〖〗*\n\n*💠 الوقت⏱️╎〖〗*\n\n*💠 نوع الفعاليه 〖مصـ🧛🏻♂️ـاص الدمـ🩸ـاء〗*\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n\n *🧛🏻♀️╿ شرح فعاليه ╿*🧛🏻‍♂️\n\n *💠 تـتـكـون مــن 5 مـشـاركـيـن بـشـر و مـصـاص دمـاء ، مصاص الدمـاء لـديـه 5 قـلـوب سـوداء 🖤 و الـبـشـر قطـرتـيـن دم 🩸*\n*💠 ويـجـب عـلـى مصـاص الدمـاء شـرب دمـائـهـم 🩸 عـكـس الـبـشـر الـذيـن يـجـب عـلـيـهـم تـدمـيـر الـقـلـوب  الـخـمـسـه الـتـي يـمـتـلـكـهـا مصـاص الدمـاء 🧛🏻‍♂️، كـل نـقـطـتـيـن يـربـحـها الـبـشـر يُـطـعـن مصـاص الدمـاء  بـالوتـد الخـشـبـي [ 🪵 ] ويُـنـتـزع  مـنـه قـلـب*\n *💠 أمـا مصـاص الدمـاء كـل نـقـطـهـا يـربـحـهـا  يشـرب قطـرة دم مــن بـشـري يـخـتـاره إذا وجـدت بـجـانـب لـقـبـك [☠] فـهـذا يـعـنـي أنـك خـسـرت.*\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n*💠اول عضو تظهر اجابته عند《 مقدم الفعالية 》وتكون صحيحة، هو من يحصل على نقطة*\n\n*💠ارسال أي صورة او فيديو خلى مسابقـة يكلفك 《إنذار》*\n\n*💠ونتمني من الجميع المشاركة في الفعاليه❤️.* \n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^فعالية مصاص الدماء$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `~*🧛🏻♂️╿اعـلان عـن نتـائـج المسـابـقـة╿🧛🏻‍♂️*~\n\n*❍↵┆جـوائــز المــســابقــة 🩸↶*\n\n*◆━━━━━◆🩸◆━━━━━◆*\n\n*❏⇍┋المــقــدم 🎙️⇩*\n\n*☯︎⇄『』*\n*💰┆⇄الجـائـزة : 「❂250」*\n\n*◆━━━━━◆🩸◆━━━━━◆*\n\n*❍↵┋اعـضـاء الفــريـق الفــائــز 🏆*\n\n*➥【  】*\n\n*💰┆⇄الجـائـزة : 「❂350」*\n\n*◆━━━━━◆🩸◆━━━━━◆*\n*❍↵┋اعـضـاء الفـريـق الخـاسـر 🏅*\n\n*〘  〙*\n\n*💰┆⇄الجـائـزة : 「❂200」*\n\n*◆━━━━━◆🩸◆━━━━━◆*\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^فعالية الهوكاجي$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*~🥷╎تعلن الادارة عن مسابقة الهوكاجي╎🥷~*\n\n*◆ ▬▬▬▬▬▬ ❴🍁❵ ▬▬▬▬▬▬ ◆*\n*💠╎ التفاصيل 📋 :*\n\n*💠آلــمــقـدم🎙️╎〖〗*\n\n*💠 عہدد ألمشاركين 🧾╎〖غير محدد〗*\n\n*💠 الوقـت⏱️╎〖الآن〗*\n\n*💠 نـوع الفعـاليه 〖الهوكـاجـ🥷ـي〗*\n\n*❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n\n *🥷╿ شرح الفـعـاليـه ╿🥷*\n\n*❶ تـتـكـون مـن عدد مـعيـن مـن الاعضـاء يجب عليـهـم تحصيل أكبـر عـدد من نقـاط الخبـرة 🕵️‍♂️*\n\n*❷ ويـجـب على المشـاركيـن الإجـابـة على الاسئـلـة التـي يتـم طـرحـها وكـل اجـابـة بنـقـطـة*\n\n*❸ يتـرقى المشارك عبـر جمـع اكبـر عـدد من النـقـاط الزوجيـة مثـلا كل 4 نقـاط ترقـية حتى يوصـل لمنصـب هوكـاجي🥷*\n *❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n*💠المراتـب هي : غينين/شونين/جونين/سانين/هوكاجي*\n\n*💠ارسـال الصـور او الفيـديـوهـات عمـدا وسط المسـابـقـة《تنبيه》و الاعتـراض يـكـون بعـد الفعـاليـة 🚨*\n\n*💠ونتـمـنى من الجميـع المشـاركـة في الفعـاليـه❤️.* \n *❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^فعالية الهوكاجي$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*●━━ ━ • ❪ 🍁 ❫  • ━ ━━●*\n\n*☯︎╎مشاركين 🍁 الفعالية 🎩*\n\n*●━━ ━ • ❪ 🍁 ❫  • ━ ━━●*\n\n*『اللقب 🎩 الرتبة 🥷 النقاط』* \n\n*←『』»『غينين』»『-』* \n*←『』»『غينين』»『-』* \n*←『』»『غينين』»『-』*\n*←『』»『غينين』»『-』* \n*←『』»『غينين』»『-』*\n*←『』»『غينين』»『-』*\n\n*●━━ ━ • ❪🍁❫  • ━ ━━●*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^فعالية الهوكاجي$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `~*🥷╿ إعلان عن نتائج مسابقة الهوكاجي ╿🥷*~\n*╭───── • ◈ • ─────╮*\n*❃ الــمــقــدم⇍【】*\n*❃ الـجــائــزة⇍【❂200】*\n\n*⊱⊹╾╾╾──❯🥷❮──╼╼╼⊹⊰*\n*⇃🥇⇂ الــمــركــز الــأول ⤋*\n*【】➥*\n*الــجــائــزة⇍『❂250』*\n\n*⇃🥈⇂ الــمــركــز الـثـاني*\n*【】➥* \n*الــجــائــزة⇍『❂200』*\n*⇃🥉⇂ الــمــركــز الثـالـث ⤋*\n*【】➥*\n*الــجــائــزة⇍『❂150』*\n\n\n*⊱⊹╾╾╾──❯🥷❮──╼╼╼⊹⊰*\n*⇃🏅⇂ بــاقــي الــمــشــاركــيــن ⤋*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*الــجــائــزة⇍『❂100』*\n*⊱⊹╾╾╾──❯🥷❮──╼╼╼⊹⊰*\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^تحويل$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*┍━━━━━╝﷽╚━━━━━┑*\n\n*🍁┊اعــلان عن تحويل┊🍁*\n\n*❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n\n*⎎┋من「」*\n\n*⎎┋الى  :『』*\n\n*⎎┋ المبلغ المحول »「❂」*\n\n*⎎┋ الرسالة『』*\n\n*👨🏻💻┋ المسؤول「」* \n\n*⟐┤────◈❨💴❩◈────├⟐*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^سؤال مفاجئ$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*~⁉️╎السـؤال المـفـاجـئ╎⁉️~*\n*⎔ ⋅ ──━ •﹝🍁﹞• ━── ⋅ ⎔*\n*❐⤶🏹┆المسـتـوى  : ⟦  ⟧*\n\n*❐⤶📜┆السـؤال  : ⟦  ⟧*\n\n*❐⤶💵┆المكـافئـة  : ⟦❂⟧*\n\n*❐⤶👨🏻💻┆المـسـؤول  : ⟦  ⟧*\n*⎔ ⋅ ──━ •﹝🍁﹞• ━── ⋅ ⎔*\n*⧉┋مـع تـحـيـات :*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^سؤال مفاجئ$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*~📯╎النـتــائـج╎📯~*\n*⎔ ⋅ ──━ •﹝🍁﹞• ━── ⋅ ⎔*\n*❍↵⁉️┆الجـواب  : ❬  ❭*\n\n*❍↵🏆┆الفـائـز   : ❬  ❭*\n\n*❍↵💵┆المكـافئـة  : ❬❂❭*\n\n*❍↵👨🏻💻┆المـسـؤول  : ❬  ❭*\n*⎔ ⋅ ──━ •﹝🍁﹞• ━── ⋅ ⎔*\n*⧉┋مـع تـحـيـات :*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^ترحيب$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*⧉┯ ┯┯ ┯ ⋅⊱🌩⊰⋅ ┯ ┯┯ ┯⧉*\n         *❉🌺تـرحـيـب🌺❉* \n\n*『𝐌𝐀𝐍𝐉𝐈 🌩︱ 猟師』* \n\n*•╎ اللقب:╎•*\n*•╎المنشن:/@╎•* \n\n*أشرقت الأنوار بقدومك وتدفق النهر في أطلالك وغردت الطيور بك فيا أهلاً ويا سهلاً بالقلب نبعثر التراحيب ونزف أستقبالنا معطر بالورد والكادي مملؤء بالحب والشوق والمشاعر ونشكرك على انضمامك معنا بين اخوانك واخواتك متمنيا لك طيب الاقامه🪷🤍.* \n\n*⧉الاعلانات : https://chat.whatsapp.com/LPxRwGcpLLLHdGK1B6uM50*\n*⧉┷ ┷┷ ┷ ⋅⊱🌩⊰⋅ ┷ ┷┷ ┷⧉*\n*╎◈ إدارهہ نقابة مانجي 🌩*\n*‏🌩  guild manji ◈╎*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^منوع$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*🍁~╎إعلان عن مسابقة╎~🍁*\n\n*❖══━═❈•|🍁|•❈═━══━❖*\n*❈╎ التفاصيل 📜 :*\n\n*⧉↵ أسئلة ❓ 」*\n*⧉↵ تعداد 🔢 」*\n*⧉↵صور 🖼️」*\n*⧉↵مقولات 🗣️ 」*\n*⧉↵ ترتيب 🧮 」*\n*⧉↵ كتابة ✍🏻 」*\n*⧉↵ أول حرف 1️⃣ 」*\n*⧉↵ آخر حرف 🔄 」*\n*⧉↵ كلمات يابانية 🈲  」*\n*⧉↵طلبات 📮 」*\n*⧉↵تفكيك 💡 」*\n*⧉↵تركيب 🧩 」*\n*⧉↵ اصـوات 🔊 」*\n*⧉↵ كلمـات عكسـيـة 🔃」*\n*⧉↵ ايمـوجـي 🙂 」*\n*❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n*❍↵ الـمـقـدم 👨🏻💻:  」*\n*❍↵ الـوقـت ⌛:  」*\n*❍↵ عـدد الاسئـلة ⁉️ :  」*\n*❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n\n*✎ ممنوع أخطاء املائية 🚫*\n*✎ ارسال صورة او فيديو بالمسابقة يكلفك انذار ⚠️*\n*✎ اول من تضهر إجابته عند المقدم يفوز 🏆*\n*❆━━━━━═⏣⊰🍁⊱⏣═━━━━━❆*\n*❍↵┆🍁「تـوقــيع  ✍🏻」*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
     if (/^منوع$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `~*🍁╿ إعلان عن نتائج المسابقة ╿🍁*~\n*╭───── • ◈ • ─────╮*\n*❃ الــمــقــدم⇍【】*\n*❃ الـجــائــزة⇍【❂100】*\n\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n*⇃🥇⇂ الــمــركــز الــأول ⤋*\n*【】➥*\n*الــجــائــزة⇍『❂120』*\n\n*⇃🥈⇂ الــمــركــز الـثـاني*\n*【】➥* \n*الــجــائــزة⇍『❂100』*\n*⇃🥉⇂ الــمــركــز الثـالـث ⤋*\n*【】➥*\n*الــجــائــزة⇍『❂70』*\n\n\n*⊱⊹╾╾╾──❯🍁❮──╼╼╼⊹⊰*\n*⇃🏅⇂ بــاقــي الــمــشــاركــيــن ⤋*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*【】➥*\n*الــجــائــزة⇍『❂50』*\n\n*╰─────• ◈ •  ─────╯*\n\n*⧉⇄┋مـع تـحـيـات ادارة:*\n\n*『𝐇𝐔𝐍𝐓𝐄𝐑𝐒 🍁¦ 猟師』*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}

return !0 }
export default handler
