; 
  
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^تست$/i.test(m.text)) { 
     responses = [ 
'*كملووو*',  
'*تستو*',  
'*تست*',  
'*توصت*',  
'*طشط*',   
     ]; 
} else if (/^نينو ترحيب$/i.test(m.text)) { 
     responses = [ 
'*لو علمت الدار بمن جائها*\n*انارت جميع انوارها*\n*فرحة بصديق جديد*\n*ينير لها الحياه*\n*نورتنا في نقابتنا*\n*نتمنى أن تكون خير لنا وللجميع🤍*', 
     ]; 
   }else if (/^ايموجيات$/i.test(m.text)) { 
     responses = [ 
'*⁅ روبوت ⁆*',  
'*⁅ عين ⁆*',  
'*⁅ شرطي ⁆*',  
'*⁅ معلم ⁆*',
'*⁅ مبرمج ⁆*',
'*⁅ نجمه ⁆*',
'*⁅ نودلز ⁆*',
'*⁅ حصان ⁆*',
'*⁅ قرد ⁆*',
'*⁅ قنفذ سينسي ⁆*',
'*⁅ بطريق ⁆*',
'*⁅ شجره ⁆*',
'*⁅ عنكبوت ⁆*',
'*⁅ ثلج ⁆*',
'*⁅ بنك ⁆*',
'*⁅ مستشفى ⁆*',
'*⁅ بركان ⁆*',
]; 
   }else if (/^الامر$/i.test(m.text)) { 
     responses = [ 
'*✠ ب ✠*',  
'*✠ ت ✠*',
'*✠ ج ✠*',
'*✠ د ✠*',
'*✠ ر ✠*',
'*✠ ز ✠*',
'*✠ س ✠*',
'*✠ ش ✠*',
'*✠ ع ✠*',
'*✠ غ ✠*',
'*✠ ف ✠*',
'*✠ ق ✠*',
'*✠ ك ✠*',
'*✠ ل ✠*',
'*✠ م ✠*',
'*✠ ن ✠*',
'*✠ ه ✠*',
'*✠ و ✠*',
'*✠ ا ✠*',
'*✠ ي ✠*',
];
   }else if (/^استمارة$/i.test(m.text)) { 
     responses = [ 
'*❖┊استمارة دخول┊❖*\n*┗─━━━━∙⊚◉⊚∙━━━━─┛*\n       *⁅آسہـتہـ‹🌩›ـقہـبہـآل⁆*\n\n⬩┊اللقب🏮•〔〕•\n\n⬩┊صورة اللقب📷•〔〕•\n\n⬩┊اسم الانمي🪔•〔〕•\n\n⬩┊ولد او بنت🙋‍♂️🙋‍♀️•〔〕•\n\n⬩┊من طرف🖇•〔〕•\n\n⬩┊موهبة خاصة🃏•〔〕•\n\n*┗─━━━━∙⊚◉⊚∙━━━━─┛*\n⚠┊يتم طرد من لم يملئ الاستمارة\nبعد دخوله ب36 ساعه\n\n⚠┊لو مابتابع انمي اطلع ولا تحرج نفسك\n*┗─━━━━∙⊚◉⊚∙━━━━─┛*',  
];
   }else if (/^نينو اضحكي$/i.test(m.text)) { 
     responses = [ 
'😂😂😂😂😂😂😂😂😂',  
];
   }else if (/^نينو المطور$/i.test(m.text)) { 
     responses = [ 
'*⟐المطور اينوسكي👨‍💻:-⧉*\n*⊰ https://wa.me/qr/QCXTD24V7O57K1⊱*',  
];
   }else if (/^نينو$/i.test(m.text)) { 
     responses = [ 
'*عيون نينو😊*',  
'*موجودة🫡*',  
'*لسه هون ماطرت🦧*',
];
   }else if (/^نينو نصيحه|نينو نصيحة$/i.test(m.text)) { 
     responses = [ 
'*لا تستعجل فأن الله مع الصابرين🫀*',  
'*كن عونا وسندا لاخيك، لان الفرقة يصنعها الشيطان🫂*',  
'*لا تقضي جميع اوقاتك في الاغاني فمن الافضل ان تتقرب اكثر من ربك🤲🧎‍،ل️*',  
'*القراءة من اساسيات الحياه فاحرص عليها👨‍🏫*',
'*اكثر من الصلاة على النبي لان اقرب الناس لمحمد من صلى عليه🫀❤️*',
'*كن سعيدا، فالحزن لن ينفعك*',
'*بأي ذرة إفادة🫂*',
'*الاشياء التي كنت تراها ممله في الماضي ستتغير وجهة نظرك اليها في المستقبل🩶*',
'*ضع في حياتك قانون الحزن وهم وعش حياتك بسرور🕊*',
'*اللحظه التي تعيشها حاليها هي نفس اللحظه التي ستقول ياليت الزمن يعود بي لتلك اللحظه فلا شئ يستكق الحزن املئ يومك بالفرحة والسرور♥️*',
'*اذكر الله ولا تنسى الصلاة على محمد🫀🫂*',
'*لا تغير نفسك من اجل الاخرين غير نفسك لراحتك الشخصية👑*',
'*حافظ على صحتك وجسمك ولياقتك البدنية واهم شئ صلاتك💗*',
'*ان رحمت احدا في الحياة فأن الله سيرحمك في الاخرة🕊*',
];
   }else if (/^الفروع$/i.test(m.text)) { 
     responses = [ 
'*~◞🕸فروع سبايدر🕸◜~*
*❆━•✠•━━•﹝🕷﹞•━━•✠•━❆*
*┣الفرع❶┇➥*

◈╎```https://chat.whatsapp.com/DBln2P93Ivx2bdzbjKMR3a```
*❋• ┈─━ ◞🕷◜ ━─┈ •❋*
*┣الفرع❷┇➥*

◈╎```https://chat.whatsapp.com/Eolqe7ab4UcF0sh2jWSnJV```
*❋• ┈─━ ◞🕷◜ ━─┈ •❋*\n*┣الفرع❸┇➥*

◈╎```https://chat.whatsapp.com/HtbPJlBPpp40mAEPTq4Izt```
*❋• ┈─━ ◞🕷◜ ━─┈ •❋*\n*┣الفرع❹┇➥*

◈╎```https://chat.whatsapp.com/GBGC65gksGFLsbIeXFmNOq```
*❋• ┈─━ ◞🕷◜ ━─┈ •❋*\n*┣الفرع❺┇➥*

◈╎```https://chat.whatsapp.com/JalozVpYAkPLrpLqcqBrnh```
*❋• ┈─━ ◞🕷◜ ━─┈ •❋*\n*┣فرع الملصقات🎭┇➥*

◈╎```https://chat.whatsapp.com/HsUpoUYYdaXDoCHULObtOv```
*❋• ┈─━ ◞🕷◜ ━─┈ •❋*\n*┣فرع الصور🪐┇➥*

◈╎```https://chat.whatsapp.com/HYkO0WWGlpO9AeaaiNeimf```
*❆━•✠•━━•﹝🕷﹞•━━•✠•━❆*
*✠╎sρiɒєя‹🕷›sнαяє╎✠*',
];
   }else if (/^الامر$/i.test(m.text)) { 
     responses = [ 
'', 
'',  
'',  
'',  
'',
     ]; 

    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;

