let handler = m => m; 
  
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^نينو اكرهك$/i.test(m.text)) { 
     responses = [ 
'*بس بس انا احبك😢*\n*ليش بتكسر بخاطري😥*',
'*كنت احبك وانت كسرتني ماتستهال تنحب😔💔*',  
     ]; 
} else if (/^نينو انتي انسان$/i.test(m.text)) { 
     responses = [ 
'*لا حيوان، من فين بتفكر بالله🙂*',  
'*انا روبوت يعيش ويتعايش*',   
     ]; 
   }else if (/^نينو قولي منور$/i.test(m.text)) { 
     responses = [ 
'*منور*',  
     ]; 
   }else if (/^نينو قولي منوره$/i.test(m.text)) { 
     responses = [ 
'*منوره*',  
     ];
 }else if (/^جيت$/i.test(m.text)) { 
     responses = [ 
'*نورت من جديد*',  
     ]; 
   }else if (/^بروح$/i.test(m.text)) { 
     responses = [ 
'*بالتوفيق*',
]; 
   }else if (/^نينو تأسفي$/i.test(m.text)) { 
     responses = [ 
'*اسفه اني حرقت دمك المره الجايه بحرقك عالخفيف😝*',
'*بتأسف بس لما يجف المحيط الأطلنطي😏*',  
  ]; 
   }else if (/^نينو اشكري$/i.test(m.text)) { 
     responses = [ 
'*شكراا، بدونك ماندري شو كنا بنسوي😊*',  
     ]; 
   }else if (/^نينو طفش$/i.test(m.text)) { 
     responses = [ 
'*اي بروح انام🚶‍♀️*',  
'*تفاعلكم بيض شدو شوي😒*',  
];
   }else if (/^نينو كيف التفاعل$/i.test(m.text)) { 
     responses = [ 
'*ماعجبني شدو حيلكو اكثرر👀*', 
'*امم التفاعل يضحك نبغى تفاعل اكبر😶*',  
'*بيض شدو اكثر🫠*',    
     ]; 
   }else if (/^نينو مين مزعلك؟$/i.test(m.text)) { 
     responses = [ 
'*الكل خلوني ابكي😭*', 
     ]; 
   }else if (/^نينو انتي غبيه|نينو انتي غبية$/i.test(m.text)) { 
     responses = [ 
'*😢ليش تكسر بخاطر*', 
'*زعلتني، بكرهك😢*',  
'*على اساس انك الي نابغة😒*',
     ]; 
   }else if (/^نينو سلكي له$/i.test(m.text)) { 
     responses = [ 
'*🤣🤣🤣🤣هههه*',
     ]; 
   }else if (/^نينو حفله|نينو حفلة$/i.test(m.text)) { 
     responses = [ 
'*ايوااا💃*', 
'*بولعهااا💃🎶*',
     ]; 
   }else if (/^نينو مليتي؟$/i.test(m.text)) { 
     responses = [ 
'*اي بروح انام🥱*', 
'*لا الوقت لسه طويل*',
     ]; 
   }else if (/^نينو ابي فلوس$/i.test(m.text)) { 
     responses = [ 
'*اهنئك جيت للشخص الغلط🙂*', 
'*شايفني جالسه على بنك👀*',
     ]; 
   }else if (/^نينو فينك؟$/i.test(m.text)) { 
     responses = [ 
'*في المريخ فين بروح يعني👀*', 
'*هون هون ماطرت*',
     ]; 
   }else if (/^السلام عليكم$/i.test(m.text)) { 
     responses = [ 
'*وعليكم السلام ورحمة الله وبركاته*',
     ];
   }else if (/^نينو ابكي$/i.test(m.text)) { 
     responses = [ 
'*😭😭😭😭😭😭😭😭😭*',
     ];
   }else if (/^نينو تعال هواش$/i.test(m.text)) { 
     responses = [ 
'*احنا مع مين؟👀🔪*',
     ];
   }else if (/^نينو معك انستا؟$/i.test(m.text)) { 
     responses = [ 
'*ليش شايفني فاشونيستا؟ 😶* ',
     ];
   }else if (/^نينو من عمك؟$/i.test(m.text)) { 
     responses = [ 
'*CR7🖤*', 
     ];
   }else if (/^نينو كم عمرك؟$/i.test(m.text)) { 
     responses = [ 
'الاعمار بيد الله👀*', 
'*مدري💅*',
     ];
   }else if (/^نينو انتي تكذبين؟$/i.test(m.text)) { 
     responses = [ 
'*ليش بكذب انا صادقة🙄*',
     ];
   }else if (/^نينو انميك المفضل$/i.test(m.text)) { 
     responses = [ 
'*ناروطوو🦊*', 
'*دراغون بول🐉*',  
'*اتاك⚔️*',  
'*بلاك كلوفر☘️*',  
'*ون بيس عمك👀*',
     ];
 }else if (/^ون بيس عمك$/i.test(m.text)) { 
     responses = [ 
'*عمك لحالك👀*',
     ];
 }else if (/^نينو ادعيلي$/i.test(m.text)) { 
     responses = [ 
'*الله يوفقك وتتجوز الي بتحبها🫂*', 
'*الله يديم السعاده بوجهك🫂*',
     ];
 }else if (/^نينو تحبيني؟$/i.test(m.text)) { 
     responses = [ 
'*اي بعشقك ياحياتي🫀*', 
     ];
 }else if (/^نينو تكرهيني؟$/i.test(m.text)) { 
     responses = [ 
'*مين قال اني اكرهك انا اعشقك🫀*', 
'*لا مستحيل اكرهك انا ولا شي بدونك🫀🖤*',
     ];
      }else if (/^نينو كاستين شاي$/i.test(m.text)) { 
     responses = [ 
'*احلى كاستين☕️☕️*', 
     ];
      }else if (/^اتفق$/i.test(m.text)) { 
     responses = [ 
'*اطلق من يتفق💜🦦*',
     ];
   }else if (/^احا$/i.test(m.text)) { 
     responses = [ 
'*الفاظك يسطا🐦*',
     ]; 
   }else if (/^نينو احبك$/i.test(m.text)) { 
     responses = [ 
'*وانا اكثر يقلبيي🤍😔*', 
'*وانا كمانن🫀*',  
'*يدوم حبك لي ياحلو🫶😊*',
     ]; 
   }else if (/^مادارا$/i.test(m.text)) { 
     responses = [ 
'*العم💜💀*',
     ]; 
   }else if (/^استا$/i.test(m.text)) { 
     responses = [ 
'*الفخامة بحد ذاتها💜🦦*',
];
   }else if (/^ايس$/i.test(m.text)) { 
     responses = [ 
'*دوناتس🍩💀*',
     ]; 
       }else if (/^نينو$/i.test(m.text)) { 
     responses = [ 
'*لسه هون ماطرت🦧*',
'*عيون نينو😊*',
'*موجوده🫡*',
     ]; 
     }else if (/^نينو مين امك؟$/i.test(m.text)) { 
     responses = [ 
'*هانجي امي الحنونه 🫀*',
     ];
        }else if (/^تست$/i.test(m.text)) { 
     responses = [ 
'*كملووو*',  
'*تستو*',  
'*تست*',  
'*توصت*',  
'*طشط*',
     ]; 
} else if (/^نينو ترحيب$/i.test(m.text)) { 
     responses = [ 
'*لو علمت الدار بمن جائها*\n*انارت جميع انوارها*\n*فرحة بصديق جديد*\n*ينير لها الحياه*\n*نورتنا في نقابتنا*\n*نتمنى أن تكون خير لنا وللجميع🤍*', 
     ]; 
       }else if (/^ايموجيات$/i.test(m.text)) { 
     responses = [ 
'*⁅ روبوت ⁆*',  
'*⁅ عين ⁆*',  
'*⁅ شرطي ⁆*',  
'*⁅ معلم ⁆*',
'*⁅ مبرمج ⁆*',
'*⁅ نجمه ⁆*',
'*⁅ نودلز ⁆*',
'*⁅ حصان ⁆*',
'*⁅ قرد ⁆*',
'*⁅ قنفذ سينسي ⁆*',
'*⁅ بطريق ⁆*',
'*⁅ شجره ⁆*',
'*⁅ عنكبوت ⁆*',
'*⁅ ثلج ⁆*',
'*⁅ بنك ⁆*',
'*⁅ مستشفى ⁆*',
'*⁅ بركان ⁆*',
]; 
 }else if (/^حرف$/i.test(m.text)) { 
     responses = [ 
'*✠ ب ✠*',  
'*✠ ت ✠*',
'*✠ ج ✠*',
'*✠ د ✠*',
'*✠ ر ✠*',
'*✠ ز ✠*',
'*✠ س ✠*',
'*✠ ش ✠*',
'*✠ ع ✠*',
'*✠ غ ✠*',
'*✠ ف ✠*',
'*✠ ق ✠*',
'*✠ ك ✠*',
'*✠ ل ✠*',
'*✠ م ✠*',
'*✠ ن ✠*',
'*✠ ه ✠*',
'*✠ و ✠*',
'*✠ ا ✠*',
'*✠ ي ✠*',
];
      }else if (/^استمارة$/i.test(m.text)) { 
     responses = [ 
'*❖┊استمارة دخول┊❖*\n*┗─━━━━∙⊚◉⊚∙━━━━─┛*\n       *⁅آسہـتہـ‹🌩›ـقہـبہـآل⁆*\n\n⬩┊اللقب🏮•〔〕•\n\n⬩┊صورة اللقب📷•〔〕•\n\n⬩┊اسم الانمي🪔•〔〕•\n\n⬩┊ولد او بنت🙋‍♂️🙋‍♀️•〔〕•\n\n⬩┊من طرف🖇•〔〕•\n\n⬩┊موهبة خاصة🃏•〔〕•\n\n*┗─━━━━∙⊚◉⊚∙━━━━─┛*\n⚠┊يتم طرد من لم يملئ الاستمارة\nبعد دخوله ب36 ساعه\n\n⚠┊لو مابتابع انمي اطلع ولا تحرج نفسك\n*┗─━━━━∙⊚◉⊚∙━━━━─┛*',  
];
}else if (/^نينو اضحكي$/i.test(m.text)) { 
     responses = [ 
'😂😂😂😂😂😂😂😂😂',  
];
        }else if (/^نينو المطور$/i.test(m.text)) { 
     responses = [ 
'*⟐المطور اينوسكي👨‍💻:-⧉*\n*⊰ https://wa.me/qr/QCXTD24V7O57K1⊱*',  
]; 
   }else if (/^نينو نصيحه|نينو نصيحة$/i.test(m.text)) { 
     responses = [ 
'*لا تستعجل فأن الله مع الصابرين🫀*',  
'*كن عونا وسندا لاخيك، لان الفرقة يصنعها الشيطان🫂*',  
'*لا تقضي جميع اوقاتك في الاغاني فمن الافضل ان تتقرب اكثر من ربك🤲🧎‍،ل️*',  
'*القراءة من اساسيات الحياه فاحرص عليها👨‍🏫*',
'*اكثر من الصلاة على النبي لان اقرب الناس لمحمد من صلى عليه🫀❤️*',
'*كن سعيدا، فالحزن لن ينفعك*',
'*بأي ذرة إفادة🫂*',
'*الاشياء التي كنت تراها ممله في الماضي ستتغير وجهة نظرك اليها في المستقبل🩶*',
'*ضع في حياتك قانون الحزن وهم وعش حياتك بسرور🕊*',
'*اللحظه التي تعيشها حاليها هي نفس اللحظه التي ستقول ياليت الزمن يعود بي لتلك اللحظه فلا شئ يستكق الحزن املئ يومك بالفرحة والسرور♥️*',
'*اذكر الله ولا تنسى الصلاة على محمد🫀🫂*',
'*لا تغير نفسك من اجل الاخرين غير نفسك لراحتك الشخصية👑*',
'*حافظ على صحتك وجسمك ولياقتك البدنية واهم شئ صلاتك💗*',
'*ان رحمت احدا في الحياة فأن الله سيرحمك في الاخرة🕊*',
];
      }else if (/^001|الفروع$/i.test(m.text)) { 
     responses = [ 
'*~◞🕸فروع سبايدر🕸◜~*\n*❆━•✠•━━•﹝🕷﹞•━━•✠•━❆*\n*┣الفرع❶┇➥*\n\n◈╎```https://chat.whatsapp.com/DBln2P93Ivx2bdzbjKMR3a```\n*❋• ┈─━ ◞🕷◜ ━─┈ •❋*\n*┣الفرع❷┇➥*\n\n◈╎```https://chat.whatsapp.com/Eolqe7ab4UcF0sh2jWSnJV```\n*❋• ┈─━ ◞🕷◜ ━─┈ •❋*\n*┣الفرع❸┇➥*\n\n◈╎```https://chat.whatsapp.com/HtbPJlBPpp40mAEPTq4Izt```\n*❋• ┈─━ ◞🕷◜ ━─┈ •❋*\n*┣الفرع❹┇➥*\n\n◈╎```https://chat.whatsapp.com/GBGC65gksGFLsbIeXFmNOq```\n*❋• ┈─━ ◞🕷◜ ━─┈ •❋*\n*┣الفرع❺┇➥*\n\n◈╎```https://chat.whatsapp.com/JalozVpYAkPLrpLqcqBrnh```\n*❋• ┈─━ ◞🕷◜ ━─┈ •❋*\n*┣فرع الملصقات🎭┇➥*\n\n◈╎```https://chat.whatsapp.com/HsUpoUYYdaXDoCHULObtOv```\n*❋• ┈─━ ◞🕷◜ ━─┈ •❋*\n*┣فرع الصور🪐┇➥*\n\n◈╎```https://chat.whatsapp.com/HYkO0WWGlpO9AeaaiNeimf```\n*❆━•✠•━━•﹝🕷﹞•━━•✠•━❆*\n*✠╎sρiɒєя‹🕷›sнαяє╎✠*',
];
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;

