let handler = m => m; 
  
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^كت|كتابه|كتابة$/i.test(m.text)) { 
     responses = [ 
       '*｟اوتا┊بروك｠*',
'*｟غوكو┊فيجيتا｠*',
'*｟غوكو┊تشي تشي｠*',
'*｟غوهان┊غوتين｠*',
'*｟بيروس┊جيرين｠*',
'*｟ليفاي┊هانجي｠*',
'*｟كانيكي┊توكا｠*',
'*｟ون بيس عمك｠*',
'*｟ميغومي┊نوبارا｠*',
'*｟ايتادوري يوجي┊غوجو ساتورو｠*',
'*｟بيك┊غابي｠*',
'*｟تاكيميتشي┊هيناتا｠*',
'*｟كيساكي تيتا┊سانو مانجيرو｠*',
'*｟تشيفويو┊باجي｠*',
'*｟غوكو┊برولي｠*',
'*｟توميوكا غيو｠*',
'*｟ايانوكوجي｠*',
'*｟ناخت┊استا｠*',
'*｟ماغنا┊لاك｠*',
'*｟اودين┊كايدو｠*<',
'*｟سابو┊غارب｠*',
'*｟نوزيل┊تشارمي｠*',
'*｟هانكوك┊ميهوك｠*',
'*｟كايتو كيد┊كونان｠*',
'*｟يوري┊لويد｠*',
'*｟انيا┊يور｠*',
'*｟غون┊كيلوا｠*',
'*｟هيسوكا┊كايتو｠*',
'*｟اليزابيث┊هوك｠*',
'*｟مليوداس┊بان｠*',
'*｟هيستوريا ريز┊يومير｠*',
'*｟توبيراما┊هاشيراما｠*',
'*｟ميناتو┊هاشيراما｠*',
'*｟ايتاشي┊ساسكي｠*',
'*｟ماركو┊تيتش｠*',
'*｟كينغ┊كوين｠*',
'*｟بيغ مام┊روكس｠*',
'*｟شانكس┊جولد روجر｠*',
'*｟كايدو┊ادوارد نيوغيت｠*',
'*｟دونكيهوتي دوفلامينغو｠*',
'*｟تينغين┊رينغوكو｠*',
'*｟شينوبو┊ميتسوري｠*',
'*｟اينوسكي┊زينيتسو｠*',
'*｟تانجيرو┊نيزوكو｠*',
'*｟رنغيكيو┊روكا｠*',
'*｟كانيكي┊توكا｠*',
'*｟غين┊ايزن｠*',
'*｟ريوزاكي┊لايت｠*',
'*｟زاراكي┊ايتشيغو｠*',
'*｟نينو┊يوتسوبا｠*',
'*｟ميكو┊اتشيكا｠*',
'*｟نويل┊ميموسا｠*',
'*｟يامي┊فنجانس｠*',
'*｟استا┊يونو｠*',
'*｟ساكورا┊هيناتا｠*',
'*｟مادارا┊جيرايا｠*',
'*｟ناروتو┊ساسكي｠*',
'*｟نامي┊روبين｠*',
'*｟زورو┊سانجي｠*',
'*｟لوفي┊ايس｠*',
'*｟ميكاسا┊اني｠*',
'*｟زيك┊راينر｠*',
'*｟ايرين┊ليفاي｠*',
 ]; 
   }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;
